In [2]:
import pandas as pd

In [2]:
housing_data=pd.read_csv("../data/california_housing.csv")
housing_data

,longitude,latitude,housing_median_age,total_rooms,total_bedrooms,population,households,median_income,ocean_proximity,median_house_value
0,-122.23,37.88,41,880,129.0,322,126,8.3252,NEAR BAY,452600
1,-122.22,37.86,21,7099,1106.0,2401,1138,8.3014,NEAR BAY,358500
2,-122.24,37.85,52,1467,190.0,496,177,7.2574,NEAR BAY,352100
3,-122.25,37.85,52,1274,235.0,558,219,5.6431,NEAR BAY,341300
4,-122.25,37.85,52,1627,280.0,565,259,3.8462,NEAR BAY,342200
...,...,...,...,...,...,...,...,...,...,...
20637,-121.09,39.48,25,1665,374.0,845,330,1.5603,INLAND,78100
20638,-121.21,39.49,18,697,150.0,356,114,2.5568,INLAND,77100
20639,-121.22,39.43,17,2254,485.0,1007,433,1.7000,INLAND,92300
20640,-121.32,39.43,18,1860,409.0,741,349,1.8672,INLAND,84700
20641,-121.24,39.37,16,2785,616.0,1387,530,2.3886,INLAND,89400

### Handling Missing Data

In [3]:
housing_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20642 entries, 0 to 20641
Data columns (total 10 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   longitude           20642 non-null  float64
 1   latitude            20642 non-null  float64
 2   housing_median_age  20642 non-null  int64
 3   total_rooms         20642 non-null  int64
 4   total_bedrooms      20435 non-null  float64
 5   population          20642 non-null  int64
 6   households          20642 non-null  int64
 7   median_income       20642 non-null  float64
 8   ocean_proximity     20642 non-null  object
 9   median_house_value  20642 non-null  int64
dtypes: float64(4), int64(5), object(1)
memory usage: 1.6+ MB

In [4]:
housing_data.describe()

,longitude,latitude,housing_median_age,total_rooms,total_bedrooms,population,households,median_income,median_house_value
count,20642.000000,20642.000000,20642.000000,20642.000000,20435.000000,20642.000000,20642.000000,20642.000000,20642.000000
mean,-119.569965,35.632077,28.641750,2635.879081,537.887937,1425.475438,499.556438,3.870715,206869.032119
std,2.003609,2.135961,12.587048,2181.542412,421.368432,1132.407658,382.315883,1.899763,115398.310245
min,-124.350000,32.540000,1.000000,2.000000,1.000000,3.000000,1.000000,0.499900,14999.000000
25%,-121.800000,33.930000,18.000000,1448.000000,296.000000,787.000000,280.000000,2.563750,119600.000000
50%,-118.490000,34.260000,29.000000,2127.000000,435.000000,1166.000000,409.000000,3.534800,179700.000000
75%,-118.010000,37.710000,37.000000,3148.000000,647.000000,1725.000000,605.000000,4.743550,264875.000000
max,-114.310000,41.950000,52.000000,39320.000000,6445.000000,35682.000000,6082.000000,15.000100,500001.000000

In [5]:
print(housing_data.isna().sum()) #Look for the null data

longitude               0
latitude                0
housing_median_age      0
total_rooms             0
total_bedrooms        207
population              0
households              0
median_income           0
ocean_proximity         0
median_house_value      0
dtype: int64

In [6]:
housing_data['total_bedrooms'].isna().sum()

np.int64(207)

#### Option 1 : Fill the missing values (null) values with the mean/median of the column

In [7]:
housing_data['total_bedrooms'].fillna(housing_data['total_bedrooms'].mean(),inplace=True)
housing_data['total_bedrooms'].isnull().sum()

np.int64(0)

#### Option 2 : Drop the entire column

In [8]:
housing_data.drop('total_bedrooms',axis=1,inplace=True)
housing_data

,longitude,latitude,housing_median_age,total_rooms,population,households,median_income,ocean_proximity,median_house_value
0,-122.23,37.88,41,880,322,126,8.3252,NEAR BAY,452600
1,-122.22,37.86,21,7099,2401,1138,8.3014,NEAR BAY,358500
2,-122.24,37.85,52,1467,496,177,7.2574,NEAR BAY,352100
3,-122.25,37.85,52,1274,558,219,5.6431,NEAR BAY,341300
4,-122.25,37.85,52,1627,565,259,3.8462,NEAR BAY,342200
...,...,...,...,...,...,...,...,...,...
20637,-121.09,39.48,25,1665,845,330,1.5603,INLAND,78100
20638,-121.21,39.49,18,697,356,114,2.5568,INLAND,77100
20639,-121.22,39.43,17,2254,1007,433,1.7000,INLAND,92300
20640,-121.32,39.43,18,1860,741,349,1.8672,INLAND,84700
20641,-121.24,39.37,16,2785,1387,530,2.3886,INLAND,89400

### Check for duplicate data

In [9]:
housing_data.duplicated().sum() #Check for duplicate rows

np.int64(2)

#### If duplicate rows are present drop them

In [10]:
housing_data.drop_duplicates(inplace=True)

In [11]:
housing_data.duplicated().sum()

np.int64(0)

### Convert Data Types
#### Convert the data to appropriate data types like int,float,datetime,string if they are not in standardized data type format

In [12]:
housing_data.dtypes # Data types are already int,float except ocean proximity

longitude             float64
latitude              float64
housing_median_age      int64
total_rooms             int64
population              int64
households              int64
median_income         float64
ocean_proximity        object
median_house_value      int64
dtype: object

### Standardize Columns
#### Remove spaces, special characters, lowercase

In [13]:
housing_data.columns=housing_data.columns.str.strip().str.lower()


### Handle Categorical Data
#### Models cannot work directly with strings. Most ML algorithms require numerical input, so encoding simplifies categorical variables, enabling models to identify patterns.

#### 1. Label Encoding / Factorize
- Assigns numbers to categories: 0, 1, 2…  
- Best for **ordinal data** ( i.e data with some priority order like Low, Medium, High)  
- Also useful for **nominal data with many unique values**  

#### 2. One-Hot Encoding
- Creates **binary columns** for each category (0/1)  
- Best for **nominal data with few categories** (e.g., INLAND, NEAR BAY, NEAR OCEAN)

In [14]:
print(housing_data['ocean_proximity'].unique())
print(housing_data['ocean_proximity'].value_counts())

['NEAR BAY' '<1H OCEAN' 'INLAND' 'NEAR OCEAN' 'ISLAND']
ocean_proximity
<1H OCEAN     9136
INLAND        6551
NEAR OCEAN    2658
NEAR BAY      2290
ISLAND           5
Name: count, dtype: int64

##### In this case One Hot Encoding is best choice as INLAND, NEAR BAY, NEAR OCEAN is nominal data also the number of unique value is less so only 3 extra columns will be added

In [15]:
housing_data=pd.get_dummies(housing_data, columns=['ocean_proximity'])
housing_data.head(5)

,longitude,latitude,housing_median_age,total_rooms,population,households,median_income,median_house_value,ocean_proximity_<1H OCEAN,ocean_proximity_INLAND,ocean_proximity_ISLAND,ocean_proximity_NEAR BAY,ocean_proximity_NEAR OCEAN
0,-122.23,37.88,41,880,322,126,8.3252,452600,False,False,False,True,False
1,-122.22,37.86,21,7099,2401,1138,8.3014,358500,False,False,False,True,False
2,-122.24,37.85,52,1467,496,177,7.2574,352100,False,False,False,True,False
3,-122.25,37.85,52,1274,558,219,5.6431,341300,False,False,False,True,False
4,-122.25,37.85,52,1627,565,259,3.8462,342200,False,False,False,True,False

#### Convert bool types to 0 and 1

In [16]:
bool_cols=housing_data.select_dtypes('bool').columns
bool_cols

Index(['ocean_proximity_<1H OCEAN', 'ocean_proximity_INLAND',
       'ocean_proximity_ISLAND', 'ocean_proximity_NEAR BAY',
       'ocean_proximity_NEAR OCEAN'],
      dtype='object')

In [17]:
housing_data[bool_cols]=housing_data[bool_cols].astype(int)
housing_data.head(10)

,longitude,latitude,housing_median_age,total_rooms,population,households,median_income,median_house_value,ocean_proximity_<1H OCEAN,ocean_proximity_INLAND,ocean_proximity_ISLAND,ocean_proximity_NEAR BAY,ocean_proximity_NEAR OCEAN
0,-122.23,37.88,41,880,322,126,8.3252,452600,0,0,0,1,0
1,-122.22,37.86,21,7099,2401,1138,8.3014,358500,0,0,0,1,0
2,-122.24,37.85,52,1467,496,177,7.2574,352100,0,0,0,1,0
3,-122.25,37.85,52,1274,558,219,5.6431,341300,0,0,0,1,0
4,-122.25,37.85,52,1627,565,259,3.8462,342200,0,0,0,1,0
5,-122.25,37.85,52,919,413,193,4.0368,269700,0,0,0,1,0
6,-122.25,37.84,52,2535,1094,514,3.6591,299200,0,0,0,1,0
7,-122.25,37.84,52,3104,1157,647,3.1200,241400,0,0,0,1,0
8,-122.26,37.84,42,2555,1206,595,2.0804,226700,0,0,0,1,0
9,-122.25,37.84,52,3549,1551,714,3.6912,261100,0,0,0,1,0

In [18]:
housing_data.columns=housing_data.columns.str.strip().str.lower() #Change the column names of ocean proximity to lower case for uniformity
housing_data.head(5)

,longitude,latitude,housing_median_age,total_rooms,population,households,median_income,median_house_value,ocean_proximity_<1h ocean,ocean_proximity_inland,ocean_proximity_island,ocean_proximity_near bay,ocean_proximity_near ocean
0,-122.23,37.88,41,880,322,126,8.3252,452600,0,0,0,1,0
1,-122.22,37.86,21,7099,2401,1138,8.3014,358500,0,0,0,1,0
2,-122.24,37.85,52,1467,496,177,7.2574,352100,0,0,0,1,0
3,-122.25,37.85,52,1274,558,219,5.6431,341300,0,0,0,1,0
4,-122.25,37.85,52,1627,565,259,3.8462,342200,0,0,0,1,0

In [19]:
housing_data.dtypes #Check data types of data

longitude                     float64
latitude                      float64
housing_median_age              int64
total_rooms                     int64
population                      int64
households                      int64
median_income                 float64
median_house_value              int64
ocean_proximity_<1h ocean       int64
ocean_proximity_inland          int64
ocean_proximity_island          int64
ocean_proximity_near bay        int64
ocean_proximity_near ocean      int64
dtype: object

### Handle the Outlier
#### Outliers are the data point which are significantly different from the other remaining data. outliers are in very less amount but had a severe effect on the performance of the Machine learning model. Thus, it is necessary to detect and handle the outliers correctly

In [20]:
cols=housing_data.select_dtypes(include=['int64','float64']).columns
print(cols)

Index(['longitude', 'latitude', 'housing_median_age', 'total_rooms',
       'population', 'households', 'median_income', 'median_house_value',
       'ocean_proximity_<1h ocean', 'ocean_proximity_inland',
       'ocean_proximity_island', 'ocean_proximity_near bay',
       'ocean_proximity_near ocean'],
      dtype='object')

In [21]:
housing_data[cols].agg(['max','min'])

,longitude,latitude,housing_median_age,total_rooms,population,households,median_income,median_house_value,ocean_proximity_<1h ocean,ocean_proximity_inland,ocean_proximity_island,ocean_proximity_near bay,ocean_proximity_near ocean
max,-114.31,41.95,52,39320,35682,6082,15.0001,500001,1,1,1,1,1
min,-124.35,32.54,1,2,3,1,0.4999,14999,0,0,0,0,0

##### The columns total_rooms, population, households, median_income, median_house_value has outliers (i.e high difference of numerical range) so they need to be handled

#### Use the Inter Quartile Range (IQR) method to handle the outliers

In [23]:
cols_to_handle_int = ['total_rooms', 'population', 'households']      # counts → int
cols_to_handle_float = ['median_income', 'median_house_value']         # continuous → float

# Handle integer columns
for col in cols_to_handle_int:
    Q1 = housing_data[col].quantile(0.25)
    Q3 = housing_data[col].quantile(0.75)
    IQR = Q3 - Q1
    lower = Q1 - 1.5*IQR
    upper = Q3 + 1.5*IQR
    housing_data[col] = housing_data[col].clip(lower, upper).astype(int)  # clip and convert back to int

# Handle float columns
for col in cols_to_handle_float:
    Q1 = housing_data[col].quantile(0.25)
    Q3 = housing_data[col].quantile(0.75)
    IQR = Q3 - Q1
    lower = Q1 - 1.5*IQR
    upper = Q3 + 1.5*IQR
    housing_data[col] = housing_data[col].clip(lower, upper)  # keep as float

print("Outliers handled successfully")

Outliers handled successfully

In [24]:
housing_data[cols].agg(['max','min'])

,longitude,latitude,housing_median_age,total_rooms,population,households,median_income,median_house_value,ocean_proximity_<1h ocean,ocean_proximity_inland,ocean_proximity_island,ocean_proximity_near bay,ocean_proximity_near ocean
max,-114.31,41.95,52,5698,3132,1092,8.013025,482412.5,1,1,1,1,1
min,-124.35,32.54,1,2,3,1,0.499900,14999.0,0,0,0,0,0

#### Save the cleaned dataset

In [27]:
housing_data.to_csv("../data/cleaned_california_housing_dataset.csv")

In [5]:
df=pd.read_csv("../data/students_report.csv")
df.head(10)

,student_id,school,sex,age,address_type,family_size,parent_status,mother_education,father_education,mother_job,...,family_relationship,free_time,social,weekday_alcohol,weekend_alcohol,health,absences,grade_1,grade_2,final_grade
0,1,GP,F,18,Urban,Greater than 3,Apart,higher education,higher education,at_home,...,4,3,4,1,1,3,6,5,6,6
1,2,GP,F,17,Urban,Greater than 3,Living together,primary education (4th grade),primary education (4th grade),at_home,...,5,3,3,1,1,3,4,5,5,6
2,3,GP,F,15,Urban,Less than or equal to 3,Living together,primary education (4th grade),primary education (4th grade),at_home,...,4,3,2,2,3,3,10,7,8,10
3,4,GP,F,15,Urban,Greater than 3,Living together,higher education,5th to 9th grade,health,...,3,2,2,1,1,5,2,15,14,15
4,5,GP,F,16,Urban,Greater than 3,Living together,secondary education,secondary education,other,...,4,3,2,1,2,5,4,6,10,10
5,6,GP,M,16,Urban,Less than or equal to 3,Living together,higher education,secondary education,services,...,5,4,2,1,2,5,10,15,15,15
6,7,GP,M,16,Urban,Less than or equal to 3,Living together,5th to 9th grade,5th to 9th grade,other,...,4,4,4,1,1,3,0,12,12,11
7,8,GP,F,17,Urban,Greater than 3,Apart,higher education,higher education,other,...,4,1,4,1,1,1,6,6,5,6
8,9,GP,M,15,Urban,Less than or equal to 3,Apart,secondary education,5th to 9th grade,services,...,4,2,2,1,1,1,0,16,18,19
9,10,GP,M,15,Urban,Greater than 3,Living together,secondary education,higher education,other,...,5,5,1,1,1,5,0,14,15,15

### GroupBy/Aggregation
#### groupby() is Pandas’ way of splitting your data into groups based on column(s) and applying some operation.

In [9]:
df.groupby('family_size')

<pandas.core.groupby.generic.DataFrameGroupBy object at 0x000001E5A288EB10>

In [10]:
df.groupby('parent_status')

In [13]:
df.groupby('parent_status').count()

,student_id,school,sex,age,address_type,family_size,mother_education,father_education,mother_job,father_job,...,family_relationship,free_time,social,weekday_alcohol,weekend_alcohol,health,absences,grade_1,grade_2,final_grade
parent_status,,,,,,,,,,,,,,,,,,,,,
Apart,41,41,41,41,41,41,41,41,41,41,...,41,41,41,41,41,41,41,41,41,41
Living together,354,354,354,354,354,354,354,354,354,354,...,354,354,354,354,354,354,354,354,354,354

#### Grouping by multiple columns

In [14]:
df.groupby(['parent_status','family_size']).count()

                                         student_id  school  sex  age  \
parent_status   family_size
Apart           Greater than 3                   21      21   21   21
                Less than or equal to 3          20      20   20   20
Living together Greater than 3                  260     260  260  260
                Less than or equal to 3          94      94   94   94

                                         address_type  mother_education  \
parent_status   family_size
Apart           Greater than 3                     21                21
                Less than or equal to 3            20                20
Living together Greater than 3                    260               260
                Less than or equal to 3            94                94

                                         father_education  mother_job  \
parent_status   family_size
Apart           Greater than 3                         21          21
                Less than or equal to 3                20          20
Living together Greater than 3                        260         260
                Less than or equal to 3                94          94

                                         father_job  school_choice_reason  \
parent_status   family_size
Apart           Greater than 3                   21                    21
                Less than or equal to 3          20                    20
Living together Greater than 3                  260                   260
                Less than or equal to 3          94                    94

                                         ...  family_relationship  free_time  \
parent_status   family_size              ...
Apart           Greater than 3           ...                   21         21
                Less than or equal to 3  ...                   20         20
Living together Greater than 3           ...                  260        260
                Less than or equal to 3  ...                   94         94

                                         social  weekday_alcohol  \
parent_status   family_size
Apart           Greater than 3               21               21
                Less than or equal to 3      20               20
Living together Greater than 3              260              260
                Less than or equal to 3      94               94

                                         weekend_alcohol  health  absences  \
parent_status   family_size
Apart           Greater than 3                        21      21        21
                Less than or equal to 3               20      20        20
Living together Greater than 3                       260     260       260
                Less than or equal to 3               94      94        94

                                         grade_1  grade_2  final_grade
parent_status   family_size
Apart           Greater than 3                21       21           21
                Less than or equal to 3       20       20           20
Living together Greater than 3               260      260          260
                Less than or equal to 3       94       94           94

[4 rows x 32 columns]

In [16]:
df.groupby(['parent_status','family_size'])['health'].count() #Operation by selecting a specific column

parent_status    family_size
Apart            Greater than 3              21
                 Less than or equal to 3     20
Living together  Greater than 3             260
                 Less than or equal to 3     94
Name: health, dtype: int64

In [15]:
df.groupby(['parent_status','family_size']).agg(['max','min']) #Applying mutiple operations ysing aggregation

                                        student_id     school     sex     age  \
                                               max min    max min max min max
parent_status   family_size
Apart           Greater than 3                 344   1     GP  GP   M   F  20
                Less than or equal to 3        391   9     MS  GP   M   F  20
Living together Greater than 3                 393   2     MS  GP   M   F  22
                Less than or equal to 3        395   3     MS  GP   M   F  19

                                            address_type         ... health  \
                                        min          max    min  ...    max
parent_status   family_size                                      ...
Apart           Greater than 3           15        Urban  Rural  ...      5
                Less than or equal to 3  15        Urban  Rural  ...      5
Living together Greater than 3           15        Urban  Rural  ...      5
                Less than or equal to 3  15        Urban  Rural  ...      5

                                            absences     grade_1     grade_2  \
                                        min      max min     max min     max
parent_status   family_size
Apart           Greater than 3            1       75   0      17   4      18
                Less than or equal to 3   1       30   0      18   7      19
Living together Greater than 3            1       54   0      19   5      19
                Less than or equal to 3   1       56   0      19   3      19

                                            final_grade
                                        min         max min
parent_status   family_size
Apart           Greater than 3            0          18   0
                Less than or equal to 3   6          19   6
Living together Greater than 3            0          20   0
                Less than or equal to 3   0          19   0

[4 rows x 64 columns]

In [17]:
df.groupby(['parent_status','family_size'])['final_grade'].agg(['max','min']) #Applying mutiple operations ysing aggregation on a single columns

                                         max  min
parent_status   family_size
Apart           Greater than 3            18    0
                Less than or equal to 3   19    6
Living together Greater than 3            20    0
                Less than or equal to 3   19    0

In [20]:
df.groupby('school').agg({
    'grade_1': 'mean',    
    'age': 'max',       
    'grade_2': 'count' ,    
    'final_grade':'min',
    'health':'std'
})

          grade_1  age  grade_2  final_grade    health
school
GP      10.939828   22      349            0  1.382607
MS      10.673913   21       46            0  1.452634

## Some other useful functions

### Concatenation

In [25]:
df1 = pd.DataFrame({'A':[1,2], 'B':[3,4]})
df2 = pd.DataFrame({'A':[5,6], 'B':[7,8]})
display(df1)
display(df2)

   A  B
0  1  3
1  2  4

   A  B
0  5  7
1  6  8

In [21]:
# Row wise Concatenation
df_row = pd.concat([df1, df2], axis=0, ignore_index=True)
print(df_row)

   A  B
0  1  3
1  2  4
2  5  7
3  6  8

In [24]:
# Columns wise Concatenation
df_column = pd.concat([df1, df2], axis=1, ignore_index=True)
print(df_column)

   0  1  2  3
0  1  3  5  7
1  2  4  6  8

### Apply and Map

In [32]:
data=df['absences'].map(lambda val:val**2)
data

0       36
1       16
2      100
3        4
4       16
      ...
390    121
391      9
392      9
393      0
394     25
Name: absences, Length: 395, dtype: int64

In [35]:
data=df.apply(lambda row: row['grade_1']+row['grade_2']+row['final_grade'],axis=1)
data

0      17
1      16
2      25
3      44
4      26
       ..
390    27
391    46
392    25
393    33
394    26
Length: 395, dtype: int64